/*********************************************************
 * ファイル名 : Robot.c
 *              rb
 * 責務       : 直立障害物検知ロボット
 * 作成日     : 2012.11.27
 * 作成者     : BackSLASH DESIGN Co.,Ltd
 * 修正日     : yyyy.mm.dd : Name : reason
 * 備考       :
 *********************************************************/

/**********************************************************
 * 自ヘッダ#include
 *********************************************************/
#include "Robot.h"
/**********************************************************
 * システムヘッダ#include
 *********************************************************/
#include "kernel.h"
#include "kernel_id.h"
#include "ecrobot_interface.h"
/**********************************************************
 * ユーザ作成ヘッダ#include
 *********************************************************/
#include "Running.h"

/**********************************************************
 * #define
 *********************************************************/
/**********************************************************
 * typedef
 *********************************************************/
/**********************************************************
 * enum
 *********************************************************/
/**********************************************************
 * struct/union
 *********************************************************/
/**********************************************************
 * 変数
 *********************************************************/
/**********************************************************
 * タスク
 *********************************************************/
DeclareTask(Task_Main);

/**********************************************************
 * 関数
 *********************************************************/
void rb_init(void);
void rb_term(void);

static void rb_light_init(void);
static void rb_light_term(void);
static U16 rb_light_sensor_read(void);
static void rb_decide_line(U16);
static void rb_decideRunning(void);
static void rb_act(void);

/**********************************************************
 * 関数名 ： rb_init
 * 機能　 ： 初期化処理
 * 引数　 ： 無
 * 戻値　 ： 無
 * 備考　 ：
 *********************************************************/
void rb_init(void)
{
  rb_light_init();
  return;
}

/**********************************************************
 * 関数名 ： rb_term
 * 機能　 ： 終了処理
 * 引数　 ： 無
 * 戻値　 ： 無
 * 備考　 ： t.tanaka
 *********************************************************/
void rb_term(void)
{
  rb_light_term();
  return;
}

/**********************************************************
 * 関数名 ： rb_light_init
 * 機能　 ： 光センサ初期化処理
 * 引数　 ： 無
 * 戻値　 ： 無
 * 備考　 ： t.tanaka
 *********************************************************/
void rb_light_init(void)
{
  ecrobot_set_light_sensor_active(NXT_PORT_S3);
  return;
}

/**********************************************************
 * 関数名 ： rb_light_term
 * 機能　 ： 光センサ終了処理
 * 引数　 ： 無
 * 戻値　 ： 無
 * 備考　 ： t.tanaka
 *********************************************************/
void rb_light_term(void)
{
  ecrobot_set_light_sensor_inactive(NXT_PORT_S3);
  return;
}

/**********************************************************
 * 関数名 ： rb_light_sensor_read
 * 機能　 ： 光センサ値取得処理
 * 引数　 ： 無
 * 戻値　 ： U16 センサ値0-1023
 * 備考　 ： t.tanaka
 *********************************************************/
U16 rb_light_sensor_read(void)
{
  return ecrobot_get_light_sensor(NXT_PORT_S3);
}

/**********************************************************
 * 関数名 ： rb_decide_line
 * 機能　 ： ライン判定処理
 * 引数　 ： 光センサ値
 * 戻値　 ： 無
 * 備考　 ： t.tanaka
 *********************************************************/
void rb_decide_line(U16 line_sense)
{
  if (line_sense >= 610) {
    rn_evLeftRun();
  }
  else
  {
    rn_evRightRun();
  }
  rn_evFrontRun();
  return;
}
/**********************************************************
 * 関数名 ： rb_decideRunning
 * 機能　 ： 走行操作を判断
 * 引数　 ： 無
 * 戻値　 ： 無
 * 備考　 ：
 *********************************************************/
static void rb_decideRunning(void)
{
  U16 light_value = 0;
  light_value = rb_light_sensor_read();
  rb_decide_line(light_value);
	//rn_evStopFrontBackRun();
	//rn_evStopRightLeftRun();
	return;
}

/**********************************************************
 * 関数名 ： rb_act
 * 機能　 ： 各出力操作を判断
 * 引数　 ： 無
 * 戻値　 ： 無
 * 備考　 ：
 *********************************************************/
static void rb_act(void)
{
  rb_decideRunning();

  /* デバッグ処理	*/
  char* str = "sample_1_OK";
  display_string(str);
  display_goto_xy(0,0);
  display_update();
  return;
}

/**********************************************************
 * タスク名 ： Task_Main
 * 機能　   ： メインタスク
 * 備考　   ： 40msec周期起動
 *********************************************************/
TASK(Task_Main)
{
  rb_act();
  TerminateTask();
}
